IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f2838x_flash_pump_semaphore_regs.xml
<module id="FLASH_PUMP_SEMAPHORE_REGS" HW_revision="" description="FLASH PUMP SEMAPHORE Registers">
	<register id="PUMPREQUEST" width="32" page="1" offset="0x0" internal="0" description="Flash programming semaphore PUMP request register">
		<bitfield id="SEM" description="Flash Pump Request Semaphore between CPU1, CPU2 and CM" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="KEY" description="Key Qualifier for writes to this register" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
</module>
